package com.yonsai.aws.controller;

public class Ec2Controller {
}

/*
 * EC2 (Elastic Compute Cloud)
 * - 인터넷으로 빌리는 내 컴퓨터
 * - 사용자가 언제든 접속 할 수 있도록 서버 프로그램을 실행하는
 * 도구!
 * 
 * 인스턴스 시작
 * - 컴퓨터 켜기
 * 
 * 온디맨드
 * - 필요할 때 사용하고 사용한 만큼 돈을 내는 방식
 * 
 * 인스턴스 실행중 - 접속하지 않아도 컴퓨터 사용 금액 발생
 * 인스턴스를 중지하셔야 돈이 부과되지 않는다.
 * 
 * 키페어
 * - EC2 컴퓨터에 안전하게 접속하기 위한 열쇠 한 쌍
 * 
 * EC2 컴퓨터를 하나 생성하면 퍼블릭 ip(전세계 공개 ip)
 * ip - 컴퓨터 주소! 실행되고 있을 때는 괜찮다!
 * 실행을 중지하면 다시 실행을 하면 ip가 바꿘다.
 * 
 * 탄력적 ip(고정ip)
 * - AWS 계정 당 하나는 무료로 제공!
 * 
 * 인터넷 공간은 ip들로 이루어져있다. 그래서 중복적인 ip는 사용할
 * 수가 없다! 고정된 ip 하나를 가지고 사용해야된다.
 */